[
  {
    "id": 1,
    "banner": "img/thcon.jpg",
    "date": "2025-05-01",
    "title": {
      "fr": "Retour sur la THCon 2025 : une aventure enrichissante",
      "en": "Looking Back at THCon 2025: An Enriching Experience"
    },
    "content": {
      "fr": "<p>La <strong>Toulouse Hacking Convention (THCon)</strong> est un événement annuel majeur dédié à la cybersécurité, réunissant chercheurs, professionnels et passionnés. Depuis sa création en 2017, la THCon s'est imposée comme un rendez-vous incontournable pour la communauté infosec en Occitanie et au-delà.</p><br><br><h2 class=\"text-3xl font-semibold\">Une programmation riche et diversifiée</h2><br><br><p>L'édition 2025 s'est tenue les 10 et 11 avril à l'auditorium Marthe Condat de l'Université Paul Sabatier, suivie le 12 avril par une journée de <strong>Capture The Flag (CTF)</strong> à l'ENSEEIHT. Les conférences ont abordé des sujets tels que : la sécurité des réseaux, l'exploitation des émissions modulées, les attaques par déni de service (DoS) ou encore la sécurité des chaînes d'approvisionnement dans Kubernetes.</p><br><br><h2 class=\"text-3xl font-semibold\">Mon rôle à la THCon2025 : de la conception à la réalisation</h2><br><br><p>Depuis octobre 2024, j'ai eu l'opportunité de m'investir pleinement dans l'organisation de la THCon2025, en occupant plusieurs rôles clés :</p><br><br><ul><br>  <li><strong>Responsable du site internet</strong> : J'ai pris en charge la gestion du site officiel de l'événement, <a href=\"https://thcon.party\" class=\"text-blue-600 hover:text-blue-800 transition-colors duration-200\">https://thcon.party</a>, en collaboration avec l'équipe organisatrice.</li><br>  <li><strong>Création du challenge \"Gunnar's Vacation\"</strong> : Avec mon collègue <strong>Lacroix Raphaël (alias Chepycou)</strong>, nous avons conçu le challenge \"Gunnar's Vacation\", un défi de géoint. Une version du challenge si vous souhaitez le consulter est disponible ici : <a href=\"gunnars_vacation\" class=\"inline-flex items-center justify-center px-4 py-1 bg-blue-600 text-white font-medium rounded-md shadow hover:bg-blue-700 transition-all duration-300\">Voir Gunnar's Vacation 🚀</a>. </li></ul><br><br><p>Cette première édition de la THCon a été une expérience incroyablement formatrice, et je prévois déjà de me réinvestir l’année prochaine, peut-être même au sein du bureau pour prendre encore plus d’initiatives.</p>",
      "en": "<p>The <strong>Toulouse Hacking Convention (THCon)</strong> is a major annual event dedicated to cybersecurity, bringing together researchers, professionals, and enthusiasts. Since its inception in 2017, THCon has established itself as a key event for the infosec community in Occitania and beyond.</p><br><br><h2 class=\"text-3xl font-semibold\">A Rich and Diverse Program</h2><br><br><p>The 2025 edition took place on April 10 and 11 at the Marthe Condat auditorium at Paul Sabatier University, followed by a <strong>Capture The Flag (CTF)</strong> day on April 12 at ENSEEIHT. The conferences covered advanced topics such as network security,exploiting modulated emissions, DoS attacks, and supply chain security in Kubernetes.</p><br><br><h2 class=\"text-3xl font-semibold\">My Role at THCon2025: From Design to Execution</h2><br><br><p>Since October 2024, I have had the opportunity to get fully involved in organizing THCon2025, taking on several key roles:</p><br><br><ul><br>  <li><strong>Website Manager</strong>: I took charge of managing the official event website, <a href=\"https://thcon.party\" class=\"text-blue-600 hover:text-blue-800 transition-colors duration-200\">https://thcon.party</a>, in collaboration with the organizing team.</li><br>  <li><strong>Creation of the \"Gunnar's Vacation\" Challenge</strong>: With my colleague <strong>Lacroix Raphaël (alias Chepycou)</strong>, we designed the \"Gunnar's Vacation\" challenge, a geoint puzzle. A version of the challenge, if you'd like to check it out, is available here : <a href=\"gunnars_vacation\" class=\"inline-flex items-center justify-center px-4 py-1 bg-blue-600 text-white font-medium rounded-md shadow hover:bg-blue-700 transition-all duration-300\">See Gunnar's Vacation 🚀</a></li></ul><br><br><p>This first edition of THCon was an incredibly formative experience, and I already plan to get more involved next year, perhaps even as part of the board to take on even more initiatives.</p>"
    }
  }
]
